{
  "format": "layers-model",
  "generatedBy": "TensorFlow.js tfjs-layers v4.0.0",
  "convertedBy": "TensorFlow.js Converter v4.0.0",
  "modelTopology": {
    "keras_version": "2.12.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential", 
      "config": {
        "name": "fish_classifier",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, 224, 224, 3],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "input_1"
            }
          }
        ]
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["model_weights.bin"],
      "weights": []
    }
  ]
}